# VertexPositionNormalColored Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPositionNormalColored Class
Members See Also
---
A geometry vertex specified as a position in space with a normal vector and a color.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexPositionNormalColored : Vertex
```

Visual Basic
---
```text
Public Class VertexPositionNormalColored _
	Inherits Vertex
```

Visual C++
---
```text
public ref class VertexPositionNormalColored : public Vertex
```

# Remarks
The color of these vertices includes a transparency component In order to render them as transparent they must be rendered in the transparent pass See the 'IsTransparentPass' method of DrawContext
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..Vertex Autodesk.Revit.DB.DirectContext3D..::..VertexPositionNormalColored
# See Also
VertexPositionNormalColored Members
Autodesk.Revit.DB.DirectContext3D Namespace